//---------------------------------------------------------------------------
//!	@file	PieceAttacker.cpp
//! @brief	ピースの攻撃機能クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include <Game/AutoChess/Component/PieceAttacker.h>
#include <Game/AutoChess/Component/PieceSensor.h>
#include <Game/AutoChess/Piece/Piece.h>
//---------------------------------------------------------
//! 初期化
//---------------------------------------------------------
void PieceAttacker::Init()
{
    __super::Init();
    //---------------------------------------------------------
    // 攻撃処理
    //---------------------------------------------------------
    auto attack_proc = [this]() {
        //---------------------------------------------------------
        //最も近い敵の駒を攻撃する(通常攻撃)
        //---------------------------------------------------------
        auto this_piece = dynamic_pointer_cast<Piece>(GetOwnerPtr());    //ピースであることが前提

        //---------------------------------------------------------
        //最も近い敵の駒に攻撃を仕掛ける
        //---------------------------------------------------------
    };
    SetProc("attack_proc", attack_proc, ProcTiming::Update, ProcPriority::NORMAL);
}
