//---------------------------------------------------------------------------
//!	@file	LevelData.h
//! @brief	レベルデータの情報構造体
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
//------------------------------------------------------
//! @brief 駒のレベル別ステータス定義
//------------------------------------------------------
struct LevelData
{
    int attack     = 0;    //!< 攻撃力
    int hp         = 0;    //!< 体力
    int move_range = 0;    //!< 移動距離

    //--------------------------------------------------
    //! @brief シリアライズ関数
    //! @param ar アーカイブ
    //! @note Cereal用のシリアライズ関数
    //--------------------------------------------------
    template <class Archive>
    void serialize(Archive& ar)
    {
        ar(CEREAL_NVP(attack), CEREAL_NVP(hp), CEREAL_NVP(move_range));
    }
};
