//---------------------------------------------------------------------------
//!	@file	LevelData.h
//! @brief	レベルデータの情報構造体
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
//------------------------------------------------------
//! @brief 駒のレベル別ステータス定義
//------------------------------------------------------
struct LevelData
{
    int attack_ = 0;    //!< 攻撃力
    int hp_     = 0;    //!< 体力

    //--------------------------------------------------
    //! @brief シリアライズ関数
    //! @param ar アーカイブ
    //! @note Cereal用のシリアライズ関数
    //--------------------------------------------------
    template <class Archive>
    void serialize(Archive& ar)
    {
        ar(CEREAL_NVP(attack_), CEREAL_NVP(hp_));
    }
};
