//---------------------------------------------------------------------------
//!	@file	BoardInfo.h
//! @brief	ボードの情報クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include "PieceInfo.h"
class Agent;    // 前方宣言
class BoardInfo
{
public:
    //@{
    //---------------------------------------------------------------------------
    //オーナーの名前を設定
    //! @param owner [in] オーナー
    //---------------------------------------------------------------------------
    void SetOwner(const std::weak_ptr<Agent>& owner);

    //---------------------------------------------------------------------------
    //  おいているピース情報を取得
    //! @retval マスの情報
    //---------------------------------------------------------------------------
    std::array<std::array<PieceInfo, 8>, 4> GetPieceInfoArray() const;

    //---------------------------------------------------------------------------
    // 任意のマスのピース参照を取得
    //! @param file [in] ファイル（列）
    //! @param rank [in] ランク（行）
    //! @retval 任意マスのピースの参照
    //---------------------------------------------------------------------------
    PieceInfo& GetSquarePieceRef(int file, int rank);

    //---------------------------------------------------------------------------
    // マスに置かれている駒の数を取得
    //! @retval 駒の数
    //---------------------------------------------------------------------------
    int GetPieceNumOnSquares() const;

    //---------------------------------------------------------------------------
    // 駒をマスに追加
    //! @param file [in] ファイル（列）
    //! @param rank [in] ランク（行）
    //! @param piece [in] 追加する駒の情報
    //---------------------------------------------------------------------------
    void AddPiece(int file, int rank, const PieceInfo& piece);

    //---------------------------------------------------------------------------
    // マスのを削除
    //! @param file [in] ファイル（列）
    //! @param rank [in] ランク（行）
    //---------------------------------------------------------------------------
    void RemovePiece(int file, int rank);
    //@}
private:
    std::weak_ptr<Agent>                    owner_;      //オーナーのウィークポインタ
    std::array<std::array<PieceInfo, 8>, 4> squares_;    //ボードのマス管理
};
