//-------------------------------------------------------------
//! @file IStatusModifierListener.h
//! @brief ピースのバフ・デバフ変更通知リスナーインターフェースの定義
//! @author 山﨑愛
//-------------------------------------------------------------
#pragma once
//-------------------------------------------------------------
//! @class IStatusModifierListener
//! @brief ピースのバフ・デバフ変更通知リスナーインターフェース
//-------------------------------------------------------------
class IStatusModifierListener
{
public:
    //---------------------------------------------------------
    //! @brief バフ・デバフ変更通知コールバック
    //---------------------------------------------------------
    virtual void OnModifierChanged() = 0;
};
