//---------------------------------------------------------------------------
//!	@file	PieceStandInfo.cpp
//! @brief	ピーススタンドの情報クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "PieceStandInfo.h"
#include <Game/AutoChess/system/GameConst.h>
#include <System/Component/ComponentModel.h>
//----------------------------------------------------------------------------
// デフォルトコンストラクタ
//----------------------------------------------------------------------------
PieceStandInfo::PieceStandInfo()
{
}
//---------------------------------------------------------------------------
//! ピースの初期化
//---------------------------------------------------------------------------
bool PieceStandInfo::AddPiece(const PieceInfo& piece)
{
    // ピースを確認
    for(auto& pieces : pieces_) {
        // 空きがある場合、ピースを追加
        if(pieces.GetTypeName() == "") {
            pieces = piece;
            return true;
        }
    }
    // 置き場が満タンなら追加されないです。
    return false;
}

//---------------------------------------------------------------------------
//! オーナーのを設定
//---------------------------------------------------------------------------
void PieceStandInfo::SetOwner(const std::weak_ptr<Agent>& owner_agent)
{
    owner_agent_ = owner_agent;
}

//---------------------------------------------------------------------------
//! マスの情報を取得
//---------------------------------------------------------------------------
std::array<PieceInfo, 8> PieceStandInfo::GetStandPieces() const
{
    return pieces_;
}

//---------------------------------------------------------------------------
//!  任意のマスのピース参照を取得
//---------------------------------------------------------------------------
PieceInfo& PieceStandInfo::GetStandPieceRef(int index)
{
    return pieces_.at(index);
}

//-----------------------------------------------------------------------------
//! マスにピースを設定
//-----------------------------------------------------------------------------
void PieceStandInfo::SetPieceAt(size_t index, const PieceInfo& piece)
{
    if(index < pieces_.size()) {
        pieces_[index] = piece;
    }
}
//---------------------------------------------------------------------------
//! ピースのスタンドが満タンかどうかを取得する関数
//---------------------------------------------------------------------------
bool PieceStandInfo::IsFull() const
{
    for(const auto& pieces : pieces_) {
        if(pieces.GetTypeName() == "") {
            return false;    // 空きがある場合、満タンではない
        }
    }
    return true;    // 全てのピースが存在する場合、満タン
}

//---------------------------------------------------------------------------
//! 取得しているピースの個数を取得する関数
//---------------------------------------------------------------------------
int PieceStandInfo::GetOwnedPieceNum() const
{
    int count = 0;    // 取得しているピースの個数
    for(const auto& pieces : pieces_) {
        if(pieces.GetTypeName() != "") {
            count++;
        }
    }
    return count;
}
