//---------------------------------------------------------------------------
//!	@file	PieceStandInfo.h
//! @brief	ピーススタンド情報クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
// 前方宣言
class PieceInfo;
class Agent;
class PieceStandInfo : public std::enable_shared_from_this<PieceStandInfo>
{
public:
    //@{
    //----------------------------------------------------------------------------
    // デフォルトコンストラクタ
    //----------------------------------------------------------------------------
    PieceStandInfo();

    //---------------------------------------------------------------------------
    //  スタンドにピースを追加する関数
    //! @param piece [in] 追加するピース
    //! @retval 自身のポインタ
    //! @note 置き場が満タンなら追加されないです。
    //---------------------------------------------------------------------------
    std::shared_ptr<PieceStandInfo> AddPiece(std::shared_ptr<PieceInfo> piece);

    //---------------------------------------------------------------------------
    //  オーナーのを設定
    //! @param owner [in] オーナー
    //! @retval 自身の共有ポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<PieceStandInfo> SetOwner(std::weak_ptr<Agent> owner_agent);

    //---------------------------------------------------------------------------
    //マスのウィークポインタを取得
    //! @retval マスのウィークポインタ
    //---------------------------------------------------------------------------
    std::array<std::weak_ptr<PieceInfo>, 8> GetStandPieces() const;

    //---------------------------------------------------------------------------
    // ピースのスタンドが満タンかどうかを取得する関数
    //! @retval 満タンの場合 true、そうでない場合 false
    //---------------------------------------------------------------------------
    bool IsFull() const;
    //@}
private:
    std::array<std::weak_ptr<PieceInfo>, 8> pieces_{};       //ピース置き場ピースのウィークポインタ
    std::weak_ptr<Agent>                    owner_agent_;    //オーナーのウィークポインタ
};
