//---------------------------------------------------------------------------
//!	@file	PieceStatus.cpp
//! @brief	ピースのステータスクラス、この情報バッファをピースの実体がインスタンスとして持つ
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "PieceStatus.h"
#include <Game/AutoChess/system/GameConst.h>
#include <System/Component/ComponentModel.h>
//-----------------------------------------------------------------------------
// デフォルトコンストラクタ
//-----------------------------------------------------------------------------
PieceStatus::PieceStatus()
{
    level_        = 1;    //ピースのレベル、重ねた数、最大は3まで、これは必ず1から始まる
    hp_           = 0;
    attack_power_ = 0;
    attack_range_ = 0.0f;
    move_speed_   = 0.0f;
}
//---------------------------------------------------------------------------
// コンストラクタ（Builder からのみ呼ばれる）。
//---------------------------------------------------------------------------
PieceStatus::PieceStatus(int hp, int power, float range, float speed)
    : hp_(hp)
    , attack_power_(power)
    , attack_range_(range)
    , move_speed_(speed)
{
}
//---------------------------------------------------------------------------
//! HP を取得する。
//---------------------------------------------------------------------------
int PieceStatus::GetHP() const
{
    return hp_;
}

//---------------------------------------------------------------------------
//! 攻撃力を取得する。
//---------------------------------------------------------------------------
int PieceStatus::GetAttackPower() const
{
    return attack_power_;
}

//---------------------------------------------------------------------------
//! 射程距離を取得する。
//---------------------------------------------------------------------------
float PieceStatus::GetAttackRange() const
{
    return attack_range_;
}

//---------------------------------------------------------------------------
//! 移動速度を取得する。
//---------------------------------------------------------------------------
float PieceStatus::GetMoveSpeed() const
{
    return move_speed_;
}

//---------------------------------------------------------------------------
//! ピースのレベルを取得する。
//---------------------------------------------------------------------------
int PieceStatus::GetLevel() const
{
    return level_;
}

//-----------------------------------------------------------------------------
//! ダメージを適用する。
//-----------------------------------------------------------------------------
void PieceStatus::ApplyDamage(int amount)
{
    hp_ = std::max(0, hp_ - amount);
}
