//---------------------------------------------------------------------------
//!	@file	PieceStandInfo.h
//! @brief	ピーススタンド情報クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include "PieceInfo.h"
// 前方宣言
class Agent;
class PieceStandInfo
{
public:
    //@{
    //----------------------------------------------------------------------------
    // デフォルトコンストラクタ
    //----------------------------------------------------------------------------
    PieceStandInfo();

    //---------------------------------------------------------------------------
    //  スタンドにピースを追加する関数
    //! @param piece [in] 追加するピース
    //! @retval ピースを追加できたかどうか
    //! @note 置き場が満タンなら追加されないです。
    //---------------------------------------------------------------------------
    bool AddPiece(PieceInfo piece);

    //---------------------------------------------------------------------------
    //  オーナーのを設定
    //! @param owner [in] オーナー
    //---------------------------------------------------------------------------
    void SetOwner(std::weak_ptr<Agent> owner_agent);

    //---------------------------------------------------------------------------
    //  マスのピース情報を取得
    //! @retval マスのピース情報
    //---------------------------------------------------------------------------
    std::array<PieceInfo, 8> GetStandPieces() const;

    //---------------------------------------------------------------------------
    // ピースのスタンドが満タンかどうかを取得する関数
    //! @retval 満タンの場合 true、そうでない場合 false
    //---------------------------------------------------------------------------
    bool IsFull() const;
    //@}
private:
    std::array<PieceInfo, 8> pieces_{};       //ピース置き場ピースのウィークポインタ
    std::weak_ptr<Agent>     owner_agent_;    //オーナーのウィークポインタ
};
