//---------------------------------------------------------------------------
//!	@file	PieceInfo.h
//! @brief	ピースの情報クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
class Agent;    // 前方宣言
class PieceInfo : public std::enable_shared_from_this<PieceInfo>
{
public:
    //@{
    //---------------------------------------------------------------------------
    // デフォルトコンストラクタ
    //---------------------------------------------------------------------------
    PieceInfo();

    //---------------------------------------------------------------------------
    // 駒の種類を取得
    //! @retval 駒の種類名
    //---------------------------------------------------------------------------
    std::string GetTypeName() const;

    //---------------------------------------------------------------------------
    // 駒の種類を設定
    //! @param 駒の種類名
    //! @retval 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<PieceInfo> SetTypeName(const std::string& type_name);

    //---------------------------------------------------------------------------
    // 所属エージェントを取得（有効なら）
    //! @retval 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<Agent> GetOwner() const;

    //---------------------------------------------------------------------------
    // 所属エージェントを設定
    //! @param agent [in] 所属エージェントのウィークポインタ
    //! @retval 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<PieceInfo> SetOwner(std::weak_ptr<Agent> agent);

    //@}
private:
    std::string          type_name_ = "";    //ピースのタイプ名
    std::weak_ptr<Agent> owner_agent_;       //オーナーのウィークポインタ
};
