#pragma once
//---------------------------------------------------------------------------
//!	@file	ComponentImage.h
//! @brief	画像コンポーネント
//! @auther 山﨑愛
//---------------------------------------------------------------------------
#include <System/Scene.h>
#include <System/Component/Component.h>

USING_PTR(ComponentImage);

class ComponentImage : public Component
{
public:
    BP_COMPONENT_DECL(ComponentImage, u8"画像コンポーネント");
    //! @{
    //	初期化処理
    void Init() override;

    //ImGui
    void GUI() override;

    //---------------------------------------------------------------------------
    // コンストラクト関数
    //---------------------------------------------------------------------------
    void Construct(ObjectPtr owner);

    //---------------------------------------------------------------------------
    //画像の設定
    //! @param image [in] 描画する画像ハンドル
    //! @retval 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<ComponentImage> SetImage(int image);

    //---------------------------------------------------------------------------
    //画像ハンドルの取得
    //! @retval 画像のハンドル
    //---------------------------------------------------------------------------
    int GetImageHandle();

    //---------------------------------------------------------------------------
    //  マウスがボタンに触れているかを返す関数
    //! @return マウスがボタンに触れているか
    //---------------------------------------------------------------------------
    bool IsMouseOver();

    //---------------------------------------------------------------------------
    //画像のサイズを取得する関数
    //! @retval 画像のサイズ
    //---------------------------------------------------------------------------
    float2 GetImageSize() const;

    //---------------------------------------------------------------------------
    //スクリーンにうつる画像の大きさを取得する関数
    //! @retval スクリーンにうつる画像の大きさ
    //---------------------------------------------------------------------------
    float2 GetScreenImageSize();

    //---------------------------------------------------------------------------
    //画像座標の補正値を取得する関数
    //! @retval 画像座標の補正値
    //---------------------------------------------------------------------------
    float3 GetAdjustment() const;

    //---------------------------------------------------------------------------
    //画像の透明度を設定する関数
    //! @param alpha [in] 透明度(0~255)
    //! @retval 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<ComponentImage> SetAlpha(int alpha);

    //---------------------------------------------------------------------------
    // この関数がフィルターとして機能するかどうかを設定する関数
    //! @param is_filter [in] フィルターとして機能するかどうか
    //---------------------------------------------------------------------------
    std::shared_ptr<ComponentImage> SetIsFilter(bool is_filter);

    //---------------------------------------------------------------------------
    // この関数がフィルターとして機能するかどうかを取得する関数
    //! @retval フィルターとして機能するかどうか
    //---------------------------------------------------------------------------
    bool GetIsFilter() const;

    //! @}

private:
    int  image_     = -1;       //!< 描画する画像ハンドル
    int  alpha_     = 255;      //!< 画像の透明度
    bool is_filter_ = false;    //!< フィルターとして機能するかどうか
    //--------------------------------------------------------------------
    //! @name Cereal処理
    //--------------------------------------------------------------------
    //@{

    //! @brief セーブ
    // @param arc アーカイバ
    // @param ver バージョン
    CEREAL_SAVELOAD(arc, ver) { arc(cereal::make_nvp("Component", cereal::base_class<Component>(this))); }
};

CEREAL_CLASS_VERSION(ComponentImage, 3);
