//---------------------------------------------------------------------------
//!	@file	MoveToNearestEnemyStrategy .h
//! @brief	ピースの移動ストラテジークラス(最も近い敵へ移動)
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include "IMoveStrategy.h"
//---------------------------------------------------------------------------
//! @class MoveToNearestEnemyStrategy
//! @brief ピースの移動ストラテジークラス(最も近い敵へ移動)
//---------------------------------------------------------------------------
class Piece;
class MoveToNearestEnemyStrategy : public IMoveStrategy
{
public:
    //---------------------------------------------------------------------------
    // ピースの移動処理
    //! @param piece      [in] 移動するピース
    //! @param delta_time [in] デルタタイム
    //---------------------------------------------------------------------------
    void Move(Piece* piece, float delta_time) override;
};
