//---------------------------------------------------------------------------
//!	@file	MoveChargeStrategy.h
//! @brief	ピースの移動ストラテジークラス(突進)
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include "IMoveStrategy.h"
//---------------------------------------------------------------------------
//! @class MoveChargeStrategy
//! @brief ピースの移動ストラテジークラス(突進)
//---------------------------------------------------------------------------
class Piece;
class MoveChargeStrategy : public IMoveStrategy
{
public:
    //---------------------------------------------------------------------------
    // デフォルトコンストラクタ
    //---------------------------------------------------------------------------
    MoveChargeStrategy();

    //---------------------------------------------------------------------------
    // 引数付きコンストラクタ
    //! @param direction [in] 突進方向
    //---------------------------------------------------------------------------
    MoveChargeStrategy(const float3& direction);

    //---------------------------------------------------------------------------
    // ピースの移動処理
    //! @param piece      [in] 移動するピース
    //! @param delta_time [in] デルタタイム
    //---------------------------------------------------------------------------
    void Move(Piece* piece, float delta_time) override;

    //---------------------------------------------------------------------------
    // 突進方向の設定
    //! @param direction [in] 突進方向
    //! @note  関数内で方向を正規化する
    //---------------------------------------------------------------------------
    void SetChargeDirection(const float3& direction);

private:
    float3      charge_direction_{0.0f, 0.0f, 0.0f};    //突進する方向
    const float charge_speed_multiplier_ = 2.0f;        //突進速度倍率
};
