//---------------------------------------------------------------------------
//!	@file	MoveTrackingStrategy.h
//! @brief	ピースの移動ストラテジークラス(突進)
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include "IMoveStrategy.h"
//---------------------------------------------------------------------------
//! @class MoveTrackingStrategy
//! @brief ピースの移動ストラテジークラス(突進)
//---------------------------------------------------------------------------
class Piece;
class MoveTrackingStrategy : public IMoveStrategy
{
public:
    //---------------------------------------------------------------------------
    // デフォルトコンストラクタ
    //---------------------------------------------------------------------------
    MoveTrackingStrategy();

    //---------------------------------------------------------------------------
    // 引数付きコンストラクタ
    //! @param target_piece [in] 追尾対象のピース
    //! @param offset       [in] 追尾対象ピースからのオフセット
    //! @param speed        [in] 追尾速度
    //---------------------------------------------------------------------------
    MoveTrackingStrategy(std::weak_ptr<Piece> target_piece, const float3& offset = float3(0.0f, 0.0f, 0.0f), float move_speed_rate = 1.0f);

    //---------------------------------------------------------------------------
    // ピースの移動処理
    //! @param piece      [in] 移動するピース
    //! @param delta_time [in] デルタタイム
    //---------------------------------------------------------------------------
    void Move(Piece* piece, float delta_time) override;

private:
    std::weak_ptr<Piece> target_piece_;              // 追尾対象のピース
    float3               offset_;                    // 追尾対象ピースからのオフセット
    float                move_speed_rate_ = 1.0f;    // 突進速度倍率
};
