//---------------------------------------------------------------------------
//!	@file	MoveWinStrategy .h
//! @brief	勝利時のピースの動きストラテジークラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include "IMoveStrategy.h"
//---------------------------------------------------------------------------
//! @class MoveWinStrategy
//! @brief 勝利時のピースの動きストラテジークラス
//---------------------------------------------------------------------------
class Piece;
class MoveWinStrategy : public IMoveStrategy
{
public:
    //---------------------------------------------------------------------------
    // ピースの移動処理
    //! @param piece      [in] 移動するピース
    //! @param delta_time [in] デルタタイム
    //---------------------------------------------------------------------------
    void Move(Piece* piece, float delta_time) override;

private:
    float1 sin_curve_rot_ = 90.0f;    // サインカーブ用の回転角
};
