//---------------------------------------------------------------------------
//!	@file	Agent.cpp
//! @brief	インゲームシーンのエージェントクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Agent.h"
#include <Game/AutoChess/system/GameConst.h>
//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool Agent::Init()
{
    __super::Init();
    SetName("Agent");
    return true;
}
//---------------------------------------------------------------------------------
//!	OnHit時に選択を行うかを返す関数
//---------------------------------------------------------------------------------
bool Agent::IsShouldSelectPiece()
{
    return should_select_piece_;
}

//---------------------------------------------------------------------------------
//!	OnHit時にドロップを行うかを返す関数
//---------------------------------------------------------------------------------
bool Agent::IsShouldDropPiece()
{
    return should_drop_piece_;
}
//---------------------------------------------------------------------------------
//!	経験値を増やす関数
//---------------------------------------------------------------------------------
std::shared_ptr<Agent> Agent::AddExp(int exp)
{
    exp_ += exp;
    return dynamic_pointer_cast<Agent>(shared_from_this());
}
//---------------------------------------------------------------------------------
//経験値量から、レベル(置ける駒数)を判定して返す関数
//---------------------------------------------------------------------------------
int Agent::GetAgentLevel()
{
    int level     = 1;
    int total_exp = 0;

    for(int i = 0; i < exp_table.size(); ++i) {
        total_exp += exp_table[i];
        if(exp_ < total_exp)
            break;
        ++level;
    }

    return level;
}
