//---------------------------------------------------------------------------
//!	@file	Camera.cpp
//! @brief	インゲームシーンのカメラ
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Camera.h"
//---------------------------------------------------------------------------------
//! @brief	初期化
//---------------------------------------------------------------------------------
bool Camera::Init()
{
    __super::Init();
    auto com_comp = AddComponent<ComponentCamera>();
    com_comp->SetPositionAndTarget({0.0f, 10.0f, -12.0f}, {0.0f, 0.0f, 0.0f});
    SetName("Camera");

    float3 default_pos = GetTranslate();
    //---------------------------------------------------------------------------------
    // 更新処理の登録
    //---------------------------------------------------------------------------------
    auto update_proc = [this, default_pos]() {
        //揺れ
        if(shake_timer > 0.0f) {
            shake_timer -= GetDeltaTime();
            //メルセンヌ・ツイスタ法による乱数生成器
            static std::mt19937                          mt{std::random_device{}()};
            static std::uniform_real_distribution<float> dist(-0.5f, 0.5f);
            //揺れのオフセットを生成
            float3 offset = float3(dist(mt), dist(mt), dist(mt));
            //揺らす
            SetTranslate(default_pos + offset);
        }
        else {
            shake_timer = 0.0f;
            //元の位置に戻す
            SetTranslate(default_pos);
        }
    };
    SetProc("update_proc", update_proc, ProcTiming::Update, ProcPriority::NORMAL);
    return true;
}

//---------------------------------------------------------------------------------
//! @brief	更新
//---------------------------------------------------------------------------------
void Camera::Update()
{
    __super::Update();
}

//---------------------------------------------------------------------------------
//! @brief	描画
//---------------------------------------------------------------------------------
void Camera::Draw()
{
    __super::Draw();
}

//---------------------------------------------------------------------------------
//! @brief	終了
//---------------------------------------------------------------------------------
void Camera::Exit()
{
    __super::Exit();
}

//---------------------------------------------------------------------------------
//! @brief	GUI表示
//---------------------------------------------------------------------------------
void Camera::GUI()
{
    __super::GUI();
}

//---------------------------------------------------------------------------
//! @brief 揺れはじめる関数
//---------------------------------------------------------------------------
void Camera::StartShake(float duration)
{
    shake_timer = duration;
}
