//---------------------------------------------------------------------------
//!	@file	InGameScene.h
//! @brief	オートチェスのインゲームシーン
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include <Game/AutoChess/system/Timer.h>
#include <Game/AutoChess/Context/GameContext.h>
#include <TsukinoDIContainer/TsukinoDIContainer.hpp>
#include <TsukinoEventBus/TsukinoEventBus.hpp>
#include <Game/AutoChess/Info/MatchInfo.h>
//前方宣言
class Agent;
class InGameScene : public Scene::Base
{
private:
    //チュートリアルのステップ
    enum class TutorialStep
    {
        None,
        PurchaseOpen,     //!< ピース購入オープン
        PurchasePiece,    //!< ピース購入
        PurchaseClose,    //!< ピース購入画面を閉じる
        PutPiece,         //!< 配置チュートリアル
    };

private:
    //ゲームの状態
    enum class GameState
    {
        Setup,     //!< 設置フェーズ
        Battle,    //!< 戦闘フェーズ
    };

public:
    BP_CLASS_DECL(InGameScene, u8"オートチェスのインゲームシーン")
    //@{
    bool Init() override;      //!< 初期化
    void Update() override;    //!< 更新
    void Draw() override;      //!< 描画
    void Exit() override;      //!< 終了
    void GUI() override;       //!< GUI表示

private:
    //----------------------------------------------------------------------
    // フェーズ遷移処理
    //! @param state 遷移したい状態
    //----------------------------------------------------------------------
    void TransitionTo(GameState state);
    //----------------------------------------------------------------------
    // バトルフェーズ開始時に、駒を生成する関数
    //----------------------------------------------------------------------
    void CreatePiecesForBattlePhase();

    //----------------------------------------------------------------------
    // バトルフェーズ終了時に、駒を破棄する関数
    //----------------------------------------------------------------------
    void DestroyPiecesAfterBattlePhase();

    //----------------------------------------------------------------------
    // セットアップの処理
    //----------------------------------------------------------------------
    void UpdateSetupPhase();

    //----------------------------------------------------------------------
    // バトルフェーズの処理
    //----------------------------------------------------------------------
    void UpdateBattlePhase();

    //----------------------------------------------------------------------
    // NPC同士のバトルをシミュレートする関数
    //----------------------------------------------------------------------
    void SimulateNpcBattle();

    //----------------------------------------------------------------------
    // エージェントの保有している生きたバトルフェーズ中の駒の数を取得する関数
    //! @param agent エージェントの共有ポインタ
    //----------------------------------------------------------------------
    int GetAlivePieceCountForAgent(const std::shared_ptr<Agent>& agent);

    //----------------------------------------------------------------------
    // ピース購入オープンボタン催促用UIを生成する関数
    //----------------------------------------------------------------------
    void CreatePurchaseOpenTutorialUI();

    //----------------------------------------------------------------------
    // チュートリアルの更新処理関数
    //----------------------------------------------------------------------
    void UpdateTutorial();

    //----------------------------------------------------------------------
    // 購入オープンチュートリアルの開始処理関数
    //----------------------------------------------------------------------
    void PurchaseOpenTutorialEnter();

    //----------------------------------------------------------------------
    // 購入オープンチュートリアルの更新処理関数
    //----------------------------------------------------------------------
    void PurchaseOpenTutorialUpdate();

    //----------------------------------------------------------------------
    // 購入オープンチュートリアルの終了処理関数
    //----------------------------------------------------------------------
    void PurchaseOpenTutorialExit();

    //----------------------------------------------------------------------
    // ピース購入チュートリアルの開始処理関数
    //----------------------------------------------------------------------
    void PurchasePieceTutorialEnter();

    //----------------------------------------------------------------------
    // ピース購入チュートリアルの更新処理関数
    //----------------------------------------------------------------------
    void PurchasePieceTutorialUpdate();

    //----------------------------------------------------------------------
    // ピース購入チュートリアルの終了処理関数
    //----------------------------------------------------------------------
    void PurchasePieceTutorialExit();

    //----------------------------------------------------------------------
    // ピース購入画面を閉じるチュートリアルの開始処理関数
    //----------------------------------------------------------------------
    void PurchaseCloseTutorialEnter();

    //----------------------------------------------------------------------
    // ピース購入画面を閉じるチュートリアルの更新処理関数
    //----------------------------------------------------------------------
    void PurchaseCloseTutorialUpdate();

    //----------------------------------------------------------------------
    // ピース購入画面を閉じるチュートリアルの終了処理関数
    //----------------------------------------------------------------------
    void PurchaseCloseTutorialExit();

    //----------------------------------------------------------------------
    // ピースを置くチュートリアルの開始処理関数
    //----------------------------------------------------------------------
    void PutPieceTutorialEnter();

    //----------------------------------------------------------------------
    // ピースを置くチュートリアルの更新処理関数
    //----------------------------------------------------------------------
    void PutPieceTutorialUpdate();

    //----------------------------------------------------------------------
    // ピースを置くチュートリアルの終了処理関数
    //----------------------------------------------------------------------
    void PutPieceTutorialExit();

    //@}
private:
    TsukinoDIContainer::Container                    di_container_;    //DIコンテナ
    Timer                                            phase_timer_;
    GameContext                                      game_context_;                           //マスターデータなどの管理クラス
    GameState                                        game_state_       = GameState::Setup;    //現在のゲーム状態、設置フェーズから開始する。
    float                                            state_timer_      = 0.0f;                // 状態経過時間（秒）
    bool                                             is_purchase_open_ = false;               //ピース購入画面が開いているかどうか
    bool                                             has_battle_ended_ = false;               //バトルが終了したかどうか
    int                                              turn_count_       = 1;                   // 現在のターン数
    std::weak_ptr<Agent>                             battle_agent_;                           //バトル中のエージェント
    std::vector<MatchInfo>                           match_infos_;                            //マッチ情報群
    std::vector<TsukinoEventBus::SubscriptionHandle> event_handles_;                          //イベントハンドル群
    TutorialStep                                     tutorial_step_   = TutorialStep::PurchaseOpen;
    bool                                             tutorial_active_ = true;
};
