//---------------------------------------------------------------------------
//!	@file	Npc.cpp
//! @brief	インゲームシーンのNPCクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Agent.h"
#include "Npc.h"
#include <Game/AutoChess/Piece/Piece.h>
#include "Square.h"
#include "ChessBoard.h"
#include "PieceStand.h"
#include "ShopStand.h"
//---------------------------------------------------------------------------------
//! @brief	初期化
//---------------------------------------------------------------------------------
bool Npc::Init()
{
    __super::Init();
    SetName("Npc");
    //テストで自陣に飛車を置いておく
    PieceInfo piece_info;
    piece_info.SetTypeName("ChessRook");
    piece_info.SetOwner(dynamic_pointer_cast<Agent>(shared_from_this()));
    SetBoardInfo(1, 1, piece_info);
    return true;
}

//---------------------------------------------------------------------------
//! @brief ターンが回ってきたときの処理を行う関数
//---------------------------------------------------------------------------
void Npc::OnTurnStart()
{
}

//---------------------------------------------------------------------------
// 駒の購入関数
//---------------------------------------------------------------------------
void Npc::PurchasePieces()
{
}

//---------------------------------------------------------------------------
//! @brief 駒を評価する関数
//---------------------------------------------------------------------------
int Npc::EvaluatePiece(const PieceInfo& p)
{
    int score = 0;    //評価値
    return score;
}

//---------------------------------------------------------------------------
//! @brief 駒を配置する関数
//---------------------------------------------------------------------------
void Npc::PlacePieces()
{
}
