//---------------------------------------------------------------------------
//!	@file	Npc.h
//! @brief	インゲームシーンのNPC(AI)クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include "Agent.h"
#include <Game/AutoChess/Piece/PieceData/PieceRepository.h>
class ChessBoard;
USING_PTR(Npc);
USING_PTR(PieceStand);
class Npc : public Agent
{
public:
    BP_OBJECT_DECL(Npc, u8"インゲームシーンのNPC(AI)クラス")
    //@{
    bool Init() override;    //!< 初期化

    //---------------------------------------------------------------------------
    // ターンが回ってきたときの処理を行う関数
    //---------------------------------------------------------------------------
    void OnTurnStart();

    //---------------------------------------------------------------------------
    // ピースのリポジトリを設定する関数
    //! @param repo [in] ピースリポジトリのポインタ
    //---------------------------------------------------------------------------
    void SetPieceRepository(const PieceRepository* repo);

private:
    //---------------------------------------------------------------------------
    // 駒の購入関数
    //---------------------------------------------------------------------------
    void PurchasePieces();

    //---------------------------------------------------------------------------
    //  駒を評価する関数
    //! @param p [in] 評価する駒
    //! @retval 駒の評価値
    //---------------------------------------------------------------------------
    int EvaluatePiece(const PieceInfo& p);

    //---------------------------------------------------------------------------
    // 経験値を購入する関数
    //---------------------------------------------------------------------------
    void PurchaseExp();

    //---------------------------------------------------------------------------
    // 駒を配置する関数
    //---------------------------------------------------------------------------
    void PlacePieces();

    //@}
private:
    const PieceRepository* piece_repo_;    //ピースのマスターデータ群
};
