//---------------------------------------------------------------------------
//!	@file	PieceFactory.h
//! @brief	駒生成クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
//前方宣言
class Piece;
class PieceFactory
{
public:
    //-----------------------------------------------------------------------
    // ピース名を受け取って対応する駒インスタンスを生成する
    //! @param type 駒の種類名
    //! @return 駒インスタンスのポインタ
    //-----------------------------------------------------------------------
    static std::shared_ptr<Piece> CreatePiece(const std::string& type);
};
