//---------------------------------------------------------------------------
//!	@file	PiecePool.h
//! @brief	駒プール
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include <Game/AutoChess/Piece/PieceData/PieceRepository.h>
//前方宣言
class PieceInfo;
class PiecePool
{
public:
    //---------------------------------------------------------------------------
    //  初期化関数
    //! @param piece_repo [in] 駒リポジトリの参照
    //---------------------------------------------------------------------------
    static void Init(const PieceRepository& piece_repo);

    //---------------------------------------------------------------------------
    //  プールから抽選を行って、駒を1体取得する
    //! @param [in] エージェントのレベル
    //! @retval 抽選で得られた駒のポインタ
    //---------------------------------------------------------------------------
    static PieceInfo GetRandomPiece(int agent_level);

    //---------------------------------------------------------------------------
    // レアリティ抽選関数
    //! @param  agent_level [in] プレイヤーの現在レベル (1〜10)
    //! @return 抽選された駒のレアリティ (★1〜★5)
    //---------------------------------------------------------------------------
    static int DrawRarity(int agent_level);

    //---------------------------------------------------------------------------
    // キ－に対応するピースをプールに戻す関数
    //! @param type_name [in] 駒の種類名
    //! @param rarity    [in] 駒のレベル
    //---------------------------------------------------------------------------
    static void ReturnPieceToPool(const std::string& type_name, int piece_level);

private:
    //五段階の各レアリティごとに、在庫数と駒の名前を管理したmapを配置
    static std::array<std::unordered_map<std::string, int>, 5> piece_pool_;
};
