//---------------------------------------------------------------------------
//!	@file	PiecePool.h
//! @brief	駒プール
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
//前方宣言
class PieceInfo;
class PiecePool
{
public:
    //---------------------------------------------------------------------------
    //  初期化関数
    //---------------------------------------------------------------------------
    static void Init();

    //---------------------------------------------------------------------------
    //  プールから抽選を行って、駒を1体取得する
    //! @retval 抽選で得られた駒のポインタ
    //---------------------------------------------------------------------------
    static std::shared_ptr<PieceInfo> GetRandomPiece();

private:
    //五段階の各レアリティごとに、在庫数と駒の名前を管理したmapを配置
    static std::array<std::unordered_map<std::string, int>, 5> piece_pool_;
};
