//---------------------------------------------------------------------------
//!	@file	Square.cpp
//! @brief	インゲームシーンのマス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Square.h"
#include "Piece.h"
#include "Agent.h"
#include <System/Component/ComponentModel.h>
#include <System/Component/ComponentCollisionModel.h>

//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool Square::Init()
{
    __super::Init();
    SetName("Square");
    SetScaleAxisXYZ(float3(0.05f, 0.05f, 0.05f));
    AddComponent<ComponentModel>("data/AutoChess/Square.mv1");
    AddComponent<ComponentCollisionModel>()->AttachToModel();
    return true;
}

//---------------------------------------------------------------------------------
//!	更新
//---------------------------------------------------------------------------------
void Square::Update()
{
    __super::Update();
    is_ray_hit_ = false;
}

//---------------------------------------------------------------------------------
//!	描画
//---------------------------------------------------------------------------------
void Square::Draw()
{
    __super::Draw();
}

//---------------------------------------------------------------------------------
//!	終了
//---------------------------------------------------------------------------------
void Square::Exit()
{
    __super::Exit();
}

//---------------------------------------------------------------------------------
//!	GUI表示
//---------------------------------------------------------------------------------
void Square::GUI()
{
    __super::GUI();
}

//---------------------------------------------------------------------------------
//!	当たり時処理
//---------------------------------------------------------------------------------
void Square::OnHit(const ComponentCollision::HitInfo& hitInfo)
{
    __super::OnHit(hitInfo);
    auto hit_owner_ = hitInfo.hit_collision_->GetOwner();
    if(hit_owner_->GetNameDefault() == "MouseRay") {
        is_ray_hit_ = true;
        if(auto owner = dynamic_pointer_cast<Agent>(owner_.lock())) {
            if(owner->IsShouldSelectPiece()) {
                if(auto piece = piece_.lock()) {
                    piece->SetSelect(true);
                }
            }
        }
    }
}

//---------------------------------------------------------------------------------
//!	マウスから出る光線にあたっているかを返す
//---------------------------------------------------------------------------------
bool Square::IsRayHit()
{
    return is_ray_hit_;
}

//---------------------------------------------------------------------------------
//!	オーナーを設定
//---------------------------------------------------------------------------------
void Square::SetOwner(std::weak_ptr<Object> owner)
{
    owner_ = owner;
}

//---------------------------------------------------------------------------------
//!	ピースを置く
//---------------------------------------------------------------------------------
void Square::SetPutPiece(std::weak_ptr<Piece> piece)
{
    piece_ = piece;
}

//---------------------------------------------------------------------------------
//!	置いてあるピースのポインタを取得
//---------------------------------------------------------------------------------
std::weak_ptr<Piece> Square::GetPutPiece()
{
    return piece_;
}
