#pragma once
//---------------------------------------------------------------------------
//!	@file	UIButton.h
//! @brief	UIのボタンオブジェクト
//! @author	山﨑愛
//---------------------------------------------------------------------------
#include <System/Scene.h>
#include "UIObject.h"
#include <System/UIComponent/ComponentButton.h>
//ポインタとして使用するための前方宣言
class ComponentImage;
USING_PTR(UIButton);

class UIButton : public UIObject
{
public:
    BP_OBJECT_DECL(UIButton, u8"UIのボタンオブジェクト")

    //@}
    bool Init() override;    //!< 初期化
    //---------------------------------------------------------------------------
    //画像の設定
    //! @param image [in] 描画する画像ハンドル
    //! @retval 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<UIButton> SetImage(int image);

    //---------------------------------------------------------------------------
    // ボタンがクリックされたかを返す関数
    //! @retval クリックされたか
    //---------------------------------------------------------------------------
    bool IsClick() const;

    //---------------------------------------------------------------------------
    //  マウスがボタンに触れているかを返す関数
    //! @return マウスがボタンに触れているか
    //---------------------------------------------------------------------------
    bool IsMouseOver() const;

    //---------------------------------------------------------------------------
    //画像ハンドルの取得
    //! @retval 画像のハンドル
    //---------------------------------------------------------------------------
    int GetImageHandle();

    //---------------------------------------------------------------------------
    //  マウスがボタンに触れている時に表示させる情報の設定
    //! @param info [in] 表示させる情報
    //! @return 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<UIButton> SetOverInformation(ComponentButton::OverInformation info);

    //---------------------------------------------------------------------------
    //  マウスをクリックした時に行う処理の設定
    //! @param info [in] クリック時の関数
    //! @return 自身のポインタ
    //---------------------------------------------------------------------------
    std::shared_ptr<UIButton> SetClickFunc(const std::function<void()>& click_func);

    //---------------------------------------------------------------------------
    // フィルターか否かをセットする関数
    //! @param is_filter [in] フィルターにするかどうか
    //---------------------------------------------------------------------------
    std::shared_ptr<UIButton> SetIsFilter(bool is_filter);

protected:
    std::weak_ptr<ComponentImage>
        image_component_;    // 文字コンポーネントへの参照、使う側が毎回GetCompoenentするのも、weak_ptrを保持しておくのもさすがに面倒なので、ここでpublicにして保持しておく
    std::weak_ptr<ComponentButton>
        button_component_;    // ボタンコンポーネントへの参照、使う側が毎回GetCompoenentするのも、weak_ptrを保持しておくのもさすがに面倒なので、ここでpublicにして保持しておく
};
