//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//!	@file	Piece.h
//! @brief	インゲームシーンのピースクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include <Game/AutoChess/Info/PieceStatus.h>    // ピースステータス情報をインスタンスとして持つのでここでインクルード
class Agent;
class UIImage;
USING_PTR(Piece);
class Piece : public Object {
public:
    BP_OBJECT_DECL(Piece, u8"インゲームシーンのピースクラス")
    //@{
    bool Init() override;    //!< 初期化


    //----------------------------------------------------------
    //選択状態の設定
    //! @param [in] is_selected 選択状態
    //----------------------------------------------------------
    void SetSelect(bool is_selected);

    //----------------------------------------------------------
    //選択状態の取得
    //! @retval 選択状態
    //----------------------------------------------------------
    bool IsSelect();

    //----------------------------------------------------------
    // 所有者エージェントの設定
    //! @param owner [in] 所有者エージェント
    //----------------------------------------------------------
    void SetOwner(const std::shared_ptr<Agent>& owner);

    //----------------------------------------------------------
    // 所有者エージェントの取得
    //! @retval 所有者エージェント
    //----------------------------------------------------------
    std::shared_ptr<Agent> GetOwner() const;

    //----------------------------------------------------------
    // HPの取得
    //! @retval 現在のHP
    //----------------------------------------------------------
    int GetHP() const;

    //----------------------------------------------------------
    // 最大HPの取得
    //! @retval 現在のHP
    //----------------------------------------------------------
    int GetMaxHP() const;

    //----------------------------------------------------------
    // 攻撃力の取得
    //! @retval 攻撃力
    //----------------------------------------------------------
    int GetAttackPower() const;

    //----------------------------------------------------------
    // 射程距離の取得
    //! @retval 射程距離
    //----------------------------------------------------------
    float GetAttackRange() const;

    //----------------------------------------------------------
    // 移動速度の取得
    //! @retval 移動速度
    //----------------------------------------------------------
    float GetMoveSpeed() const;

    //----------------------------------------------------------
    // ピースのレベルの取得
    //! @retval ピースのレベル
    //----------------------------------------------------------
    int GetLevel() const;

    //----------------------------------------------------------
    // ダメージを受ける
    //! @param amount [in] ダメージ量
    //----------------------------------------------------------
    void TakeDamage(int amount);

    //----------------------------------------------------------
    // 駒をレベルアップさせる関数
    //----------------------------------------------------------
    void LevelUp();

    //@}
protected:
    PieceStatus          status_;                 //!< ピースステータス情報
    std::weak_ptr<Agent> owner_;                  //!< 所有者エージェント
    std::weak_ptr<UIImage> level_ui_;              //!< レベル表示用UI画像コンポーネント
    bool                 is_selected_ = false;    //!< 選択されているかどうか
};
