//---------------------------------------------------------------------------
//!	@file	Piece.h
//! @brief	インゲームシーンのピースクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include <Game/AutoChess/Info/PieceStatus.h>    // ピースステータス情報をインスタンスとして持つのでここでインクルード
#include <Game/AutoChess/Piece/PieceData/PieceData.h>
#include <Game/AutoChess/system/GameConst.h>
#include <Game/AutoChess/Info/PieceStatusModifier.h>
#include <Game/AutoChess/Info/IStatusModifierListener.h>
class Agent;
class UIImage;
class ComponentActiveSkill;
USING_PTR(Piece);
class Piece : public Object ,public IStatusModifierListener{
public:
    BP_OBJECT_DECL(Piece, u8"インゲームシーンのピースクラス")
    //@{
    bool Init() override;    //!< 初期化


    //----------------------------------------------------------
    //選択状態の設定
    //! @param [in] is_selected 選択状態
    //----------------------------------------------------------
    void SetSelect(bool is_selected);

    //----------------------------------------------------------
    //選択状態の取得
    //! @retval 選択状態
    //----------------------------------------------------------
    bool IsSelect();

    //----------------------------------------------------------
    // 所有者エージェントの設定
    //! @param owner [in] 所有者エージェント
    //----------------------------------------------------------
    void SetOwner(const std::shared_ptr<Agent>& owner);

    //----------------------------------------------------------
    // 所有者エージェントの取得
    //! @retval 所有者エージェント
    //----------------------------------------------------------
    std::shared_ptr<Agent> GetOwner() const;

    //----------------------------------------------------------
    // HPの取得
    //! @retval 現在のHP
    //----------------------------------------------------------
    int GetHP() const;

    //----------------------------------------------------------
    // 最大HPの取得
    //! @retval 現在のHP
    //----------------------------------------------------------
    int GetMaxHP() const;

    //----------------------------------------------------------
    // 攻撃力の取得
    //! @retval 攻撃力
    //----------------------------------------------------------
    int GetAttackPower() const;

    //----------------------------------------------------------
    // 射程距離の取得
    //! @retval 射程距離
    //----------------------------------------------------------
    float GetAttackRange() const;

    //----------------------------------------------------------
    // 攻撃間隔の取得
    //! @retval 攻撃間隔
    //----------------------------------------------------------
    float GetAttackInterval() const;

    //----------------------------------------------------------
    // 移動速度の取得
    //! @retval 移動速度
    //----------------------------------------------------------
    float GetMoveSpeed() const;

    //----------------------------------------------------------
    // ピースのレベルの取得
    //! @retval ピースのレベル
    //----------------------------------------------------------
    int GetLevel() const;

    //----------------------------------------------------------
    // ピースレベルを設定する関数
    //! @param level [in] ピースレベル
    //----------------------------------------------------------
    void SetLevel(int level);

    //----------------------------------------------------------
    // ダメージを受ける
    //! @param amount [in] ダメージ量
    //! @param damage_type [in] ダメージタイプ
    //----------------------------------------------------------
    void TakeDamage(int amount, DamageType damage_type = DamageType::Physical);

    //----------------------------------------------------------
    // HPを回復する関数
    //! @param amount [in] 回復量
    //----------------------------------------------------------
    void Heal(int amount);

    //----------------------------------------------------------
    // 駒をレベルアップさせる関数
    //----------------------------------------------------------
    void LevelUp();

    //----------------------------------------------------------
    // 参照するマスターデータを設定する関数
    //! @param master [in] 参照マスターデータ
    //----------------------------------------------------------
    void SetMasterData(const PieceData* master);

    //----------------------------------------------------------
    // マスターデータを参照して、ピースステータスを更新する関数
    //----------------------------------------------------------
    void ApplyStatsFromMaster();

    //----------------------------------------------------------
    // ピースの価格を取得する関数
    //! @retval ピースの価格
    //----------------------------------------------------------
    int GetPrice()const;

    //----------------------------------------------------------
    // 最終的なピースステータス情報を更新する関数
    //----------------------------------------------------------
    void UpdateFinalStatus();

    //----------------------------------------------------------
    // status_modifier_が変化したときに呼ばれるコールバック関数
    //! @note IStatusModifierListenerの実装
    //----------------------------------------------------------
    void OnModifierChanged() override ;

    //----------------------------------------------------------
    // 最大HP加算値を増やす（modifier操作）
    //! @param value 増加量
    //----------------------------------------------------------
    void AddMaxHPModifier(int value);

    //----------------------------------------------------------
    // 最大HP加算値を減らす（modifier操作）
    //! @param value 減少量
    //----------------------------------------------------------
    void RemoveMaxHPModifier(int value);

    //----------------------------------------------------------
    // 最大HP倍率を増やす（modifier操作）
    //! @param value 増加量(%)
    //----------------------------------------------------------
    void AddRateMaxHPModifier(float value);

    //----------------------------------------------------------
    // 最大HP倍率を減らす（modifier操作）
    //! @param value 減少量(%)
    //----------------------------------------------------------
    void RemoveRateMaxHPModifier(float value);

    //----------------------------------------------------------
    // 攻撃力加算値を増やす（modifier操作）
    //! @param value 増加量
    //----------------------------------------------------------
    void AddAttackPowerModifier(int value);

    //----------------------------------------------------------
    // 攻撃力加算値を減らす（modifier操作）
    //! @param value 減少量
    //----------------------------------------------------------
    void RemoveAttackPowerModifier(int value);

    //----------------------------------------------------------
    // 攻撃力倍率を増やす（modifier操作）
    //! @param value 増加量(%)
    //----------------------------------------------------------
    void AddRateAttackPowerModifier(float value);

    //----------------------------------------------------------
    // 攻撃力倍率を減らす（modifier操作）
    //! @param value 減少量(%)
    //----------------------------------------------------------
    void RemoveRateAttackPowerModifier(float value);

    //----------------------------------------------------------
    // 攻撃間隔加算値を増やす（modifier操作）
    //! @param value 増加量(秒)
    //----------------------------------------------------------
    void AddAttackIntervalModifier(float value);

    //----------------------------------------------------------
    // 攻撃間隔加算値を減らす（modifier操作）
    //! @param value 減少量(秒)
    //----------------------------------------------------------
    void RemoveAttackIntervalModifier(float value);

    //----------------------------------------------------------
    // 攻撃間隔倍率を増やす（modifier操作）
    //! @param value 増加量(%)
    //----------------------------------------------------------
    void AddRateAttackIntervalModifier(float value);

    //----------------------------------------------------------
    // 攻撃間隔倍率を減らす（modifier操作）
    //! @param value 減少量(%)
    //----------------------------------------------------------
    void RemoveRateAttackIntervalModifier(float value);

    //----------------------------------------------------------
    // 物理防御力加算値を増やす（modifier操作）
    //! @param value 増加量
    //----------------------------------------------------------
    void AddPhysicalDefenseModifier(int value);

    //----------------------------------------------------------
    // 物理防御力加算値を減らす（modifier操作）
    //! @param value 減少量
    //----------------------------------------------------------
    void RemovePhysicalDefenseModifier(int value);

    //----------------------------------------------------------
    // 物理防御力倍率を増やす（modifier操作）
    //! @param value 増加量(%)
    //----------------------------------------------------------
    void AddRatePhysicalDefenseModifier(float value);

    //----------------------------------------------------------
    // 物理防御力倍率を減らす（modifier操作）
    //! @param value 減少量(%)
    //----------------------------------------------------------
    void RemoveRatePhysicalDefenseModifier(float value);

    //----------------------------------------------------------
    // 魔法防御力加算値を増やす（modifier操作）
    //! @param value 増加量
    //----------------------------------------------------------
    void AddMagicalDefenseModifier(float value);

    //----------------------------------------------------------
    // 魔法防御力加算値を減らす（modifier操作）
    //! @param value 減少量
    //----------------------------------------------------------
    void RemoveMagicalDefenseModifier(float value);

    //----------------------------------------------------------
    // 魔法防御力倍率を増やす（modifier操作）
    //! @param value 増加量(%)
    //----------------------------------------------------------
    void AddRateMagicalDefenseModifier(float value);

    //----------------------------------------------------------
    // 魔法防御力倍率を減らす（modifier操作）
    //! @param value 減少量(%)
    //----------------------------------------------------------
    void RemoveRateMagicalDefenseModifier(float value);

    //---------------------------------------------------------------------------
    // 他のmodifierの内容を加算する（modifier操作）
    //! @param other 加算するmodifier
    //---------------------------------------------------------------------------
    void AddModifier(const PieceStatusModifier& other);

    //---------------------------------------------------------------------------
    // 他のmodifierの内容を減算する
    //! @param other 減算するmodifier
    //---------------------------------------------------------------------------
    void RemoveModifier(const PieceStatusModifier& other);

    //----------------------------------------------------------
    // 最終ステータスを取得する関数
    //! @retval 最終ステータス
    //----------------------------------------------------------
    PieceStatus GetFinalStatus() const;

    //@}
protected:
    const PieceData* master_;                     //!< 参照マスターデータ
    PieceStatus          status_;                 //!< ピースステータス情報
    PieceStatusModifier  status_modifier_;        //!< ピースステータスに対してのバフ・デバフ情報
    PieceStatus          final_status_;           //!< 最終的なピースステータス情報
    std::weak_ptr<Agent> owner_;                  //!< 所有者エージェント
    std::weak_ptr<UIImage> level_ui_;              //!< レベル表示用UI画像コンポーネント
    std::weak_ptr<ComponentActiveSkill> active_skill_; //!< アクティブスキルコンポーネント
    bool                 is_selected_ = false;    //!< 選択されているかどうか
};
