//---------------------------------------------------------------------------
//!	@file	Piece.cpp
//! @brief	インゲームシーンのピースクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Piece.h"
#include <Game/AutoChess/system/GameConst.h>
#include <System/Component/ComponentModel.h>
//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool Piece::Init()
{
    __super::Init();
    SetTranslate(float3(0.0f, 0.5f, 0.0f));    // 初期位置を設定
    SetName("Piece");
    auto model = AddComponent<ComponentModel>("data/AutoChess/Piece/King.mv1");
    model->SetScaleAxisXYZ(0.005f);
    return true;
}

//---------------------------------------------------------------------------------
//!	選択状態の設定
//---------------------------------------------------------------------------------
void Piece::SetSelect(bool is_selected)
{
    is_selected_ = is_selected;
}

//---------------------------------------------------------------------------------
//!	選択状態の取得
//---------------------------------------------------------------------------------
bool Piece::IsSelect()
{
    return is_selected_;
}
