//---------------------------------------------------------------------------
//!	@file	Piece.cpp
//! @brief	インゲームシーンのピースクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Piece.h"
#include <Game/AutoChess/system/GameConst.h>
#include <System/Component/ComponentModel.h>
#include <Game/AutoChess/UIObject/UIImage.h>
#include <Game/AutoChess/system/ImageBuffer.h>
//---------------------------------------------------------------------------------
//!	初期化
//---------------------------------------------------------------------------------
bool Piece::Init()
{
    __super::Init();
    SetTranslate(float3(0.0f, 0.5f, 0.0f));    // 初期位置を設定
    SetName("Piece");
    //---------------------------------------------------------------------------------
    // ピースのステータス情報を設定(Pieceの基底クラスなので、とりあえず参照しても大丈夫なように値を入れて置きます。)
    //---------------------------------------------------------------------------------
    status_ = PieceStatus::Create().HP(100).AttackPower(5).AttackRange(1.0f).MoveSpeed(1.0f).Build();
    //---------------------------------------------------------------------------------
    // レベル表示画像の追加
    //---------------------------------------------------------------------------------
    {
        auto level_image = Scene::Object::Create<UIImage>();    //レベル表示用の画像オブジェクトを生成
        level_image->SetName("PieceLevelImage");
        level_image->SetImage(ImageBuffer::GetImageHandle("level1_star"));           //レベル1の画像を設定
        level_image->SetAlignment(ComponentTransformUI::Alignment::MiddleCenter);    //中央に表示
        level_image->SetScaleAxisXYZ(0.3f);                                          //画像を小さくする
        //ピースのワールド行列をスクリーン行列に変換したい
    }
    return true;
}

//---------------------------------------------------------------------------------
//!	選択状態の設定
//---------------------------------------------------------------------------------
void Piece::SetSelect(bool is_selected)
{
    is_selected_ = is_selected;
}

//---------------------------------------------------------------------------------
//!	選択状態の取得
//---------------------------------------------------------------------------------
bool Piece::IsSelect()
{
    return is_selected_;
}
//----------------------------------------------------------
//! 所有者エージェントの設定
//----------------------------------------------------------
void Piece::SetOwner(const std::shared_ptr<Agent>& owner)
{
    owner_ = owner;
}

//----------------------------------------------------------
// 所有者エージェントの取得
//! @retval 所有者エージェント
//----------------------------------------------------------
std::shared_ptr<Agent> Piece::GetOwner() const
{
    return owner_.lock();
}

//----------------------------------------------------------
//! HPの取得
//----------------------------------------------------------
int Piece::GetHP() const
{
    return status_.GetHP();
}

//----------------------------------------------------------
//! 攻撃力の取得
//----------------------------------------------------------
int Piece::GetAttackPower() const
{
    return status_.GetAttackPower();
}

//----------------------------------------------------------
//! 射程距離の取得
//----------------------------------------------------------
float Piece::GetAttackRange() const
{
    return status_.GetAttackRange();
}

//----------------------------------------------------------
//! 移動速度の取得
//----------------------------------------------------------
float Piece::GetMoveSpeed() const
{
    return status_.GetMoveSpeed();
}

//----------------------------------------------------------
// ピースのレベルの取得
//----------------------------------------------------------
int Piece::GetLevel() const
{
    return status_.GetLevel();
}

//----------------------------------------------------------
//! ダメージを受ける
//----------------------------------------------------------
void Piece::TakeDamage(int amount)
{
    status_.ApplyDamage(amount);
}
