//---------------------------------------------------------------------------
//!	@file	GameRepository.cpp
//! @brief	シーン間で受け渡しするデータ用のリポジトリクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "GameRepository.h"
//---------------------------------------------------------------------------
//! @brief プレイヤーの最終順位を設定
//---------------------------------------------------------------------------
void GameRepository::SetPlayerRank(int rank)
{
    player_rank_ = std::clamp(rank, 1, 8);
}

//---------------------------------------------------------------------------
//! @brief プレイヤーの最終順位を取得
//---------------------------------------------------------------------------
int GameRepository::GetPlayerRank() const
{
    return player_rank_;
}
