//---------------------------------------------------------------------------
//!	@file	GameRepository.cpp
//! @brief	シーン間で受け渡しするデータ用のリポジトリクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <Game/AutoChess/system/singleton.h>
//---------------------------------------------------------------------------
//! @class  GameRepository
//! @brief  シーン間で受け渡しするデータ用のリポジトリクラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
class GameRepository : public Singleton<GameRepository>
{
public:
    //---------------------------------------------------------------------------
    // プレイヤーの最終順位を設定
    //! @param rank プレイヤーの最終順位
    //---------------------------------------------------------------------------
    void SetPlayerRank(int rank);

    //---------------------------------------------------------------------------
    // プレイヤーの最終順位を取得
    //! @return プレイヤーの最終順位
    //---------------------------------------------------------------------------
    int GetPlayerRank() const;

private:
    int player_rank_ = 0;    //!< プレイヤーの最終順位
};
