//---------------------------------------------------------------------------
//!	@file	HlslppUseful.cpp
//! @brief	Hlslppの拡張
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
//---------------------------------------------------------------------------
//	マウス座標を float2 で取得
//! @retval マウスのスクリーン座標
//---------------------------------------------------------------------------
float2 GetMouseFloat2();

//---------------------------------------------------------------------------
//	2Dの四角同士の当たり判定（座標と大きさに Float2 を渡すバージョン）
//---------------------------------------------------------------------------
bool CheckBoxCenterHit(const float2& box_pos1, const float2& box_size1, const float2& box_pos2, const float2& box_size2);

//---------------------------------------------------------------------------
//	2Dの四角と点の当たり判定（座標と大きさに Float2 を渡すバージョン）
//---------------------------------------------------------------------------
bool CheckBoxPointHit(const float2& box_pos, const float2& box_size, const float2& point);

//---------------------------------------------------------------------------
// ワールド座標をスクリーン座標に変換する関数
//! @param world_position [in] ワールド座標
//! @retval スクリーン上のピクセルの座標
//---------------------------------------------------------------------------
float2 WorldPositionToScreenPosition(const float3& world_position);

//---------------------------------------------------------------------------------
//	二項係数を算出する関数
//! @param n [in] 全体の要素数。
//! @param k [in] 選択する要素数。
//! @return int 二項係数
//---------------------------------------------------------------------------------
int BinomialCoefficient(int n, int k);

//---------------------------------------------------------------------------------
//  バーンスタイン基底関数 b_{i,n}(t) を計算
//! @param i 基底関数のインデックス。
//! @param n ベジェ曲線の次数。
//! @param t 補間パラメータ（0.0～1.0）
//! @return float 指定された t における基底関数の値。
//--------------------------------------------------------------------------------
float BernsteinBasis(int i, int n, float t);

//---------------------------------------------------------------------------------
// 3Dのベジェ曲線を生成する関数
//! @param controlPoints 制御点のリスト（float3型）。
//! @param t 補間パラメータ（0.0～1.0）。
//! @ return float3 曲線上の補間された点。
//--------------------------------------------------------------------------------
float3 Bezier3D(const std::vector<float3>& control_points, float t);
