//---------------------------------------------------------------------------
//!	@file	Logic.h
//! @brief	ゲームロジック置き場
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
class Agent;    // 前方宣言
//---------------------------------------------------------------------------
//	ラウンド終了時の所持金計算関数
//! @param agent [in] エージェント
//! @param isWin [in] 勝利したかどうか
//! @retval ラウンド終了時の所持金増加量
//! @note 勝利ボーナス、連勝・連敗ボーナス、利子を含む
//---------------------------------------------------------------------------
int CalculateRoundGold(const std::shared_ptr<Agent>& agent, bool isWin);
