//---------------------------------------------------------------------------
//!	@file	SoundManager.h
//! @brief	効果音とBGMを管理するクラスの定義
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
#include <Game/AutoChess/system/singleton.h>
#include <Game/AutoChess/system/SoundData.h>
//---------------------------------------------------------------------------
//! @class SoundManager
//! @brief 効果音とBGMを管理するクラス
//! @note  Singletonを継承し、シングルトンとして実装
//---------------------------------------------------------------------------
class SoundManager : public Singleton<SoundManager>
{
public:
    //---------------------------------------------------------------------------
    // サウンドデータから効果音とBGMをロードする関数
    //! @param data サウンドデータの参照
    //---------------------------------------------------------------------------
    void LoadFromData(const SoundData& data);

    //---------------------------------------------------------------------------
    // 効果音を再生する関数
    //! @param name 効果音の名前
    //---------------------------------------------------------------------------
    void PlaySE(const std::string& name);

    //---------------------------------------------------------------------------
    // 効果音を停止する関数
    //! @param name 効果音の名前
    //---------------------------------------------------------------------------
    void StopSE(const std::string& name);

    //---------------------------------------------------------------------------
    // 再生中かどうか判定
    //! @param name 効果音の名前
    //! @return 再生中ならtrueを返す
    //---------------------------------------------------------------------------
    bool IsPlayingSE(const std::string& name) const;

    //---------------------------------------------------------------------------
    // BGMを再生する関数
    //! @param name BGMの名前
    //---------------------------------------------------------------------------
    void PlayBGM(const std::string& name);

    //---------------------------------------------------------------------------
    // 再生中のBGMを停止する関数
    //! @param name BGMの名前
    //---------------------------------------------------------------------------
    void StopBGM(const std::string& name);

    //---------------------------------------------------------------------------
    // 再生中かどうか判定
    //! @param name BGMの名前
    //! @return 再生中ならtrueを返す
    //---------------------------------------------------------------------------
    bool IsPlayingBGM(const std::string& name) const;

private:
    std::unordered_map<std::string, int> se_handles_;     // 効果音のハンドルマップ
    std::unordered_map<std::string, int> bgm_handles_;    // BGMのハンドルマップ
};
