//---------------------------------------------------------------------------
//!	@file	UIHitManager.cpp
//! @brief	UIとマウスの当たり情報を管理するクラスの実装
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "UIHitManager.h"
#include <Game/AutoChess/UIObject/UIObject.h>
#include <system/UIComponent/ComponentImage.h>
//---------------------------------------------------------------------------------
//! @brief マウスがUIFilterに当たっているかを取得する
//---------------------------------------------------------------------------------
bool UIHitManager::IsMouseHitUIFilter()
{
    //---------------------------------------------------------------------------------
    // UIObjectを取得
    //---------------------------------------------------------------------------------
    auto ui_objects = Scene::Object::GetArray<UIObject>();
    //---------------------------------------------------------------------------------
    // UIFilterに当たっているかチェック
    //---------------------------------------------------------------------------------
    bool is_hit = false;
    for(auto& ui_object : ui_objects) {
        //---------------------------------------------------------------------------------
        // オブジェクトにUIImageコンポーネントがあるかチェック
        //---------------------------------------------------------------------------------
        if(auto image_comp = ui_object->GetComponent<ComponentImage>()) {
            //---------------------------------------------------------------------------------
            // Imageコンポーネントのフィルター
            //---------------------------------------------------------------------------------
            if(image_comp->GetIsFilter()) {
                if(!ui_object->GetStatus(Object::StatusBit::NoDraw)) {
                    //---------------------------------------------------------------------------------
                    // Imageコンポーネントのマウスオーバーチェック
                    //---------------------------------------------------------------------------------
                    if(image_comp->IsMouseOver()) {
                        is_hit = true;
                        break;
                    }
                }
            }
        }
    }
    return is_hit;
}
