//---------------------------------------------------------------------------
//!	@file	UIHitManager.h
//! @brief	UIとマウスの当たり情報を管理するクラスの定義
//! @author 山﨑愛
//---------------------------------------------------------------------------
#pragma once
#include <System/Scene.h>
class UIHitManager
{
public:
    //---------------------------------------------------------------------------------
    // マウスがUIFilterに当たっているかを取得する
    //! @retval 当たっているならtrue、当たっていないならfalse
    //---------------------------------------------------------------------------------
    static bool IsMouseHitUIFilter();
};
