//---------------------------------------------------------------------------
//!	@file	Synergy.cpp
//! @brief	シナジーの情報クラス
//! @author 山﨑愛
//---------------------------------------------------------------------------
#include "Synergy.h"
//--------------------------------------------------
//! @brief シナジーIDを取得
//--------------------------------------------------
SynergyID Synergy::GetID() const
{
    return id_;
}

//--------------------------------------------------
//! @brief シナジー名を取得
//--------------------------------------------------
const std::string& Synergy::GetName() const
{
    return name_;
}

//--------------------------------------------------
//! @brief シナジー説明文を取得
//--------------------------------------------------
const std::string& Synergy::GetDescription() const
{
    return description_;
}

//--------------------------------------------------
//! @brief シナジー効果を取得
//--------------------------------------------------
const std::shared_ptr<SynergyEffect>& Synergy::GetEffect() const
{
    return effect_;
}

//--------------------------------------------------
//! @brief 発動数を取得
//--------------------------------------------------
int Synergy::GetSynergyCount() const
{
    return synergy_count_;
}

//--------------------------------------------------
//! @brief カウントを増やす
//--------------------------------------------------
void Synergy::IncrementSynergyCount()
{
    synergy_count_++;
}
